/*
Java: знакомство и как пользоваться базовым API (лекции)
Урок 5. Хранение и обработка данных ч2: множество коллекций Map
https://gb.ru/lessons/404316


План занятия:
    1. Обзор функционала Map
    2. Зачем нужен HashMap
    3. HashMap и работа с ним
    4. Обзор функционала TreeMap
    5. Обзор функционала LinkedHashMap
    6. Примеры


Иерархия коллекций
_________________________________________________________________________________
                                                                                 |
                                   <<Interface>>                                 |
                                    Collection                                   |
                                    /    |    \                                  |
                    _______________/     |     \___________                      |
-------------------/---------------------|-----------------\---------------------|
                  /            |         |           |      \                    |
        <<Interface>>          |    <<Interface>>    |    <<Interface>>          |
            Set                |        List         |        Queue              |
         (расширяет)           |     (расширяет)     |      (расширяет)          |
          /     \              |       /    \ \______|__      /    \             |
---------/-------\-------------|------/------\-------|--\----/------\------------|
        /      |  \            |     /     |  \      |   \  /    |   \           |
   HashSet     | <<Interface>> | ArrayList | Vector  | LikedList | PriorityQueue |
 (реализует)   |  SortedSet    |  (реал.)  | (реал.) |  (реал.)  |  (реализует)  |
      |        | (расширяет)   |           |         |           |               |
      |        |      |        |           |         |           |               |
 LinkedHashSet | <<Interface>> |           |         |           |               |
  (расширяет)  |  NavigableSet |           |         |           |               |
               |  (расширяет)  |           |         |           |               |
               |      |        |___________|_________|___________|_______________|
               |    TreeSet    |                                                 |
               |  (реализует)  |                     MAP                         |
_______________|_______________|_________________________________________________|


Иерархия Map
____________________________________________
                                            |
                     Map                    |
                    / | \                   |
          _________/  |  \________          |
---------/------------|-----------\---------|
        /       |     |        |   \        |
    HashMap     |  SortedMap   | HashTable  |
       |        |     |        |            |
 LinkedHashhMap | NavigableMap |            |
                |     |        |            |
                |   TreeMap    |            |
________________|______________|____________|


HashMap

Map – это множество коллекций, работающих с данными
по принципу <Ключ / Значение>.

Ключевые особенности:
● ускоренная обработка данных;
● порядок добавления не запоминается.
В HashMap элементы располагаются как угодно 
и могут менять свое положение.

 */
package JavaCourse.Lesson05;

public class L01HashMap {
    
}
