/*
Java: знакомство и как пользоваться базовым API (семинары)
Урок 1. Знакомство с языком программирования Java
https://gb.ru/lessons/414471/homework


Задача 1
N-ое треугольное число

Вычислить n-ое треугольного число(сумма чисел от 1 до n).

Внутри класса Answer напишите метод countNTriangle, который принимает число n и возвращает его n-ое треугольное число.
Если число n < 1 (ненатуральное) метод должен вернуть -1.

Пример
n = 4 -> 10
n = 5 -> 15

 */
package JavaHomework.Home01;

public class H02CountNum {
    
}
