/*
Java: знакомство и как пользоваться базовым API (лекции)
Урок 2. Почему вы не можете не использовать API
https://gb.ru/lessons/404313


Что такое API

API (Application programming interface) — 
это контракт, который предоставляет программа. 
«Ко мне можно обращаться так и так, я обязуюсь 
делать то и это».

habr (ссылка)


Что такое API для нас

Это возможности, который предоставляют 
разработчики языка для удобного 
взаимодействия с его функционалом


Что такое API для нас на примерах

1. Строки
2. Работа с файловой системой
3. Логирование
4. Импорт
5. Xml

 */
package JavaCourse.Lesson02;

public class L01String {
    
}
