/*
Урок 1. Знакомство с языком программирования Java
https://gb.ru/lessons/404312


01:42:00
Задачи для демонстрации
Задачи для самоконтроля

1. Задана натуральная степень k. Сформировать случайным образом 
список коэффициентов (значения от 0 до 100) многочлена многочлен степени k. 

*Пример: k=2 => 2*x² + 4*x + 5 = 0 или x² + 5 = 0 или 10*x² = 0

2. Даны два файла, в каждом из которых находится запись многочлена. 
Сформировать файл содержащий сумму многочленов.
 */

package JavaCourse.Lesson01;

public class TestTasks {
    
}
